Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAMV70N19.xml
        <register caption="Version Register" name="QSPI_VERSION" offset="0x00FC" rw="R" size="4">
          <bitfield caption="Hardware Module Version" mask="0x00000FFF" name="VERSION"/>
          <bitfield caption="Metal Fix Number" mask="0x00070000" name="MFN"/>
        </register>
      </register-group>
      <value-group caption="" name="QSPI_MR__SMM">
        <value caption="The QSPI is in SPI mode." name="SPI" value="0"/>
        <value caption="The QSPI is in Serial Memory mode." name="MEMORY" value="1"/>
      </value-group>
      <value-group caption="" name="QSPI_MR__LLB">
        <value caption="Local loopback path disabled." name="DISABLED" value="0"/>
        <value caption="Local loopback path enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="" name="QSPI_MR__WDRBT">
        <value caption="No effect. In SPI mode, a transfer can be initiated whatever the state of the QSPI_RDR is." name="DISABLED" value="0"/>
        <value caption="In SPI mode, a transfer can start only if the QSPI_RDR is empty, i.e., does not contain any unread data. This mode prevents overrun error in reception." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="" name="QSPI_MR__CSMODE">
        <value caption="The chip select is deasserted if TD has not been reloaded before the end of the current transfer." name="NOT_RELOADED" value="0x0"/>
        <value caption="The chip select is deasserted when the bit LASTXFER is written at 1 and the character written in TD has been transferred." name="LASTXFER" value="0x1"/>
        <value caption="The chip select is deasserted systematically after each transfer." name="SYSTEMATICALLY" value="0x2"/>
      </value-group>
      <value-group caption="" name="QSPI_MR__NBBITS">
        <value caption="8 bits for transfer" name="_8_BIT" value="0x0"/>
        <value caption="9 bits for transfer" name="_9_BIT" value="0x1"/>
        <value caption="10 bits for transfer" name="_10_BIT" value="0x2"/>
        <value caption="11 bits for transfer" name="_11_BIT" value="0x3"/>
        <value caption="12 bits for transfer" name="_12_BIT" value="0x4"/>
        <value caption="13 bits for transfer" name="_13_BIT" value="0x5"/>
        <value caption="14 bits for transfer" name="_14_BIT" value="0x6"/>
        <value caption="15 bits for transfer" name="_15_BIT" value="0x7"/>
        <value caption="16 bits for transfer" name="_16_BIT" value="0x8"/>
      </value-group>
      <value-group caption="" name="QSPI_IFR__WIDTH">
        <value caption="Instruction: Single-bit SPI / Address-Option: Single-bit SPI / Data: Single-bit SPI" name="SINGLE_BIT_SPI" value="0x0"/>
        <value caption="Instruction: Single-bit SPI / Address-Option: Single-bit SPI / Data: Dual SPI" name="DUAL_OUTPUT" value="0x1"/>
        <value caption="Instruction: Single-bit SPI / Address-Option: Single-bit SPI / Data: Quad SPI" name="QUAD_OUTPUT" value="0x2"/>
        <value caption="Instruction: Single-bit SPI / Address-Option: Dual SPI / Data: Dual SPI" name="DUAL_IO" value="0x3"/>
        <value caption="Instruction: Single-bit SPI / Address-Option: Quad SPI / Data: Quad SPI" name="QUAD_IO" value="0x4"/>
        <value caption="Instruction: Dual SPI / Address-Option: Dual SPI / Data: Dual SPI" name="DUAL_CMD" value="0x5"/>
        <value caption="Instruction: Quad SPI / Address-Option: Quad SPI / Data: Quad SPI" name="QUAD_CMD" value="0x6"/>
      </value-group>
      <value-group caption="" name="QSPI_IFR__OPTL">
        <value caption="The option code is 1 bit long." name="OPTION_1BIT" value="0x0"/>
        <value caption="The option code is 2 bits long." name="OPTION_2BIT" value="0x1"/>
        <value caption="The option code is 4 bits long." name="OPTION_4BIT" value="0x2"/>
        <value caption="The option code is 8 bits long." name="OPTION_8BIT" value="0x3"/>
      </value-group>
      <value-group caption="" name="QSPI_IFR__ADDRL">
        <value caption="The address is 24 bits long." name="_24_BIT" value="0"/>
        <value caption="The address is 32 bits long." name="_32_BIT" value="1"/>
      </value-group>
      <value-group caption="" name="QSPI_IFR__TFRTYP">
        <value caption="Read transfer from the serial memory.Scrambling is not performed.Read at random location (fetch) in the serial Flash memory is not possible." name="TRSFR_READ" value="0x0"/>
        <value caption="Read data transfer from the serial memory.If enabled, scrambling is performed.Read at random location (fetch) in the serial Flash memory is possible." name="TRSFR_READ_MEMORY" value="0x1"/>
        <value caption="Write transfer into the serial memory.Scrambling is not performed." name="TRSFR_WRITE" value="0x2"/>
        <value caption="Write data transfer into the serial memory.If enabled, scrambling is performed." name="TRSFR_WRITE_MEMORY" value="0x3"/>
      </value-group>
      <value-group caption="" name="QSPI_IFR__CRM">
        <value caption="The Continuous Read mode is disabled." name="DISABLED" value="0"/>
        <value caption="The Continuous Read mode is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="" name="QSPI_SMR__SCREN">
        <value caption="The scrambling/unscrambling is disabled." name="DISABLED" value="0"/>
        <value caption="The scrambling/unscrambling is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="" name="QSPI_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0." name="PASSWD" value="0x515350"/>
      </value-group>
    </module>
    <module caption="Reset Controller" name="RSTC" version="11009I">
      <register-group name="RSTC">
        <register caption="Control Register" name="RSTC_CR" offset="0x00" rw="W" size="4">
          <bitfield caption="Processor Reset" mask="0x00000001" name="PROCRST"/>
          <bitfield caption="External Reset" mask="0x00000008" name="EXTRST"/>
          <bitfield caption="System Reset Key" mask="0xFF000000" name="KEY" values="RSTC_CR__KEY"/>
        </register>
